index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-29 Tue 01:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Viktor Sonesten" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf992b6">1. About</a>
<ul>
<li><a href="#orgfc36970">1.1. Features</a>
<ul>
<li><a href="#orgc45e6ff">1.1.1. Trace</a></li>
<li><a href="#org2a28aa9">1.1.2. Replay</a></li>
</ul>
</li>
<li><a href="#orga10fe38">1.2. Project repositories/crates</a></li>
</ul>
</li>
<li><a href="#org188bb72">2. Requirements</a>
<ul>
<li><a href="#orgeed369e">2.1. Hardware</a></li>
<li><a href="#orga670227">2.2. Software</a></li>
</ul>
</li>
<li><a href="#org06f7399">3. Getting started</a></li>
<li><a href="#orgd19e32a">4. Examples</a>
<ul>
<li><a href="#org58eb138">4.1. blinky</a></li>
</ul>
</li>
<li><a href="#org9d53020">5. How it works</a></li>
<li><a href="#org1b1685e">6. Limitations</a>
<ul>
<li><a href="#orgadbb2db">6.1. Target-side overhead</a></li>
</ul>
</li>
<li><a href="#orgacf5b2b">7. License</a></li>
<li><a href="#org446ea40">8. Contact, bug reports and contributions</a></li>
</ul>
</div>
</div>
<p>
<b>NOTE:</b> The content on this page is a work in progress.
</p>

<div id="outline-container-orgaf992b6" class="outline-2">
<h2 id="orgaf992b6"><span class="section-number-2">1.</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>RTIC Scope</b> is a zero-overhead framework for recording and analyzing
execution traces from RTIC applications on ARM Cortex-M targets.
</p>
</div>

<div id="outline-container-orgfc36970" class="outline-3">
<h3 id="orgfc36970"><span class="section-number-3">1.1.</span> Features</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc45e6ff" class="outline-4">
<h4 id="orgc45e6ff"><span class="section-number-4">1.1.1.</span> Trace</h4>
</div>
<div id="outline-container-org2a28aa9" class="outline-4">
<h4 id="org2a28aa9"><span class="section-number-4">1.1.2.</span> Replay</h4>
</div>
</div>

<div id="outline-container-orga10fe38" class="outline-3">
<h3 id="orga10fe38"><span class="section-number-3">1.2.</span> Project repositories/crates</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt><a href="https://github.com/rtic-scope/frontend-dummy">frontend-dummy</a></dt><dd>A "noop" frontend implementation that writes
received <code>api::EventChunk</code> structs to stderr with nanosecond timestamp information.</dd>
<dt><a href="https://github.com/rtic-scope/cargo-rtic-scope">cargo-rtic-scope</a></dt><dd>The RTIC Scope backend which builds the target
application, recovers trace information, traces the target, replays
traces, etc.</dd>
<dt><a href="https://github.com/rtic-scope/api">api</a></dt><dd>The common API used between the RTIC Scope backend and all frontends.</dd>
<dt><a href="https://github.com/rtic-scope/examples">examples</a></dt><dd>A set of example target applications where the RTIC Scope
framework is applied. These are documented below in <a href="#orgd19e32a">4</a>.</dd>
<dt><a href="https://github.com/rtic-scope/rtic-trace">rtic-trace</a></dt><dd>The <code>no_std</code> crate used to configure the target for
tracing purposes.</dd>
<dt><a href="https://github.com/rtic-scope/itm-decode">itm-decode</a></dt><dd>A host-side library that decodes the binary trace stream
received from the target to workable Rust structures.</dd>
<dt><a href="https://github.com/rtic-scope/rfcs">rfcs</a></dt><dd>A catch-all meta-repository for discussions that encompasses more than a single repository.</dd>
<dt><a href="https://github.com/rtic-scope/rtic-scope.github.io">rtic-scope.github.io</a></dt><dd>The source code for this page.</dd>
</dl>
</div>
</div>
</div>


<div id="outline-container-org188bb72" class="outline-2">
<h2 id="org188bb72"><span class="section-number-2">2.</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgeed369e" class="outline-3">
<h3 id="orgeed369e"><span class="section-number-3">2.1.</span> Hardware</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>An embedded system with an ARM Cortex-M MCU and available asyncronous
trace pin output.</li>
<li>Serial hardware.</li>
</ul>
</div>
</div>

<div id="outline-container-orga670227" class="outline-3">
<h3 id="orga670227"><span class="section-number-3">2.2.</span> Software</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>A recent Linux-based operating system.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org06f7399" class="outline-2">
<h2 id="org06f7399"><span class="section-number-2">3.</span> Getting started</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-fundamental">$ cargo install cargo-rtic-scope
$ cargo install rtic-scope-frontend-dummy
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd19e32a" class="outline-2">
<h2 id="orgd19e32a"><span class="section-number-2">4.</span> Examples</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org58eb138" class="outline-3">
<h3 id="org58eb138"><span class="section-number-3">4.1.</span> blinky</h3>
</div>
</div>

<div id="outline-container-org9d53020" class="outline-2">
<h2 id="org9d53020"><span class="section-number-2">5.</span> How it works</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>cargo-rtic-scope</code> is abstracted in a single-producer, multiple-consumer fashion, where &#x2026;
the heavy work is done while tracing:
</p>
<ul class="org-ul">
<li>build the target application</li>
<li>generate task resolve maps from application RTIC <code>#[app]</code> declaration</li>
<li>reset the target and sample timestamp</li>
</ul>
</div>
</div>

<div id="outline-container-org1b1685e" class="outline-2">
<h2 id="org1b1685e"><span class="section-number-2">6.</span> Limitations</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgadbb2db" class="outline-3">
<h3 id="orgadbb2db"><span class="section-number-3">6.1.</span> Target-side overhead</h3>
</div>
</div>

<div id="outline-container-orgacf5b2b" class="outline-2">
<h2 id="orgacf5b2b"><span class="section-number-2">7.</span> License</h2>
<div class="outline-text-2" id="text-7">
<p>
TBA
</p>
</div>
</div>

<div id="outline-container-org446ea40" class="outline-2">
<h2 id="org446ea40"><span class="section-number-2">8.</span> Contact, bug reports and contributions</h2>
<div class="outline-text-2" id="text-8">
<p>
Bug reports and contributions are welcome. Please file it under the <a href="#orga10fe38">relevant repository</a>.
</p>

<p>
Project maintainer can be reached via email at <a href="mailto:vikson-6@student.ltu.se">&lt;vikson-6@student.ltu.se&gt;</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Viktor Sonesten</p>
<p class="date">Created: 2021-06-29 Tue 01:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
